МедПреды_sql/src/InformationRegisters/ПрофилиМобильныхПользователей/ПрофилиМобильныхПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрофилиМобильныхПользователей</name>
  <resources>
    <name>Профиль</name>
    <type>
      <types>EnumRef.ПрофилиМобильногоПриложения</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МедПреды_sql/src/Enums/ПериодыВыгрузкиВМобильноеПриложение/ПериодыВыгрузкиВМобильноеПриложение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПериодыВыгрузкиВМобильноеПриложение</name>
  <enumValues>
    <name>ЗаПоследнийКвартал</name>
  </enumValues>
  <enumValues>
    <name>ЗаПоследнийМесяц</name>
  </enumValues>
  <enumValues>
    <name>ЗаПоследнююНеделю</name>
  </enumValues>
  <enumValues>
    <name>ЗаПоследнийДень</name>
  </enumValues>
  <enumValues>
    <name>ЗаВсеВремя</name>
  </enumValues>
</mdclass:Enum>

МедПреды_sql/src/Enums/ПрофилиМобильногоПриложения/ПрофилиМобильногоПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПрофилиМобильногоПриложения</name>
  <enumValues>
    <name>Супервайзер</name>
  </enumValues>
  <enumValues>
    <name>МедПредставитель</name>
  </enumValues>
</mdclass:Enum>

МедПреды_sql/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МедПреды_sql/src/WebServices/MobileService/Module.bsl
#Область ОбработчикиМетодов

Функция ЗаписатьДанные(КодМобильногоКомпьютера, ДанныеМобильногоПриложения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзелОбмена = ПланыОбмена.МобильноеПриложение.НайтиПоКоду(КодМобильногоКомпьютера); 
	
	Если УзелОбмена.Пустая() Тогда
		ВызватьИсключение(НСтр("ru='Неизвестное устройство - '") + КодМобильногоКомпьютера);
	КонецЕсли;
	
	ОбменМобильноеПриложениеОбщее.ОбработатьПринятыйПакетЗагрузки(УзелОбмена, ДанныеМобильногоПриложения, Истина);
	
КонецФункции

Функция ПолучитьДанные(КодМобильногоКомпьютера)
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзелОбмена = ПланыОбмена.МобильноеПриложение.НайтиПоКоду(КодМобильногоКомпьютера); 
	
	Если УзелОбмена.Пустая() Тогда
		ВызватьИсключение(НСтр("ru='Неизвестное устройство - '") + КодМобильногоКомпьютера);
	КонецЕсли;
	
	Возврат ОбменМобильноеПриложениеОбщее.СформироватьЕдиныйПакетВыгрузки(УзелОбмена);
	
КонецФункции

Функция ПолучитьПакетОбмена(КодМобильногоКомпьютера, НомерСообщенияОбмена, ИдентификаторЗадания)
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзелОбмена = ПланыОбмена.МобильноеПриложение.НайтиПоКоду(КодМобильногоКомпьютера); 
	
	Если УзелОбмена.Пустая() Тогда
		ВызватьИсключение(НСтр("ru='Неизвестное устройство - '") + КодМобильногоКомпьютера);
	КонецЕсли;
	
	Возврат ОбменМобильноеПриложениеОбщее.ПолучитьСообщениеОбмена(УзелОбмена, НомерСообщенияОбмена, ИдентификаторЗадания);
	
КонецФункции

Функция ОтправитьПакетОбменаВСервис(ДанныеМобильногоПриложения, КодМобильногоКомпьютера, НаименованиеМобильногоКомпьютера, НомерОтправленного, НомерПринятого, ПериодВыгрузки, ВерсияМобильногоПриложения)
	
	СтруктураОтвета = Новый Структура("ИдентификаторЗадания, НовыйОбмен", Неопределено, Ложь);
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	ПроверитьПраваПользователя(Пользователь);
	ПроверитьДоступУстройства(КодМобильногоКомпьютера);
	ПроверитьДоступВерсии(ВерсияМобильногоПриложения);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПериодВыгрузкиВМобильноеПриложениеУстановленный = МедПредыПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		Пользователь,
		"ПериодВыгрузкиВМобильноеПриложение"
	);

	Если ПериодВыгрузки = "За последний квартал" Тогда
		ПериодВыгрузкиВМобильноеПриложение = Перечисления.ПериодыВыгрузкиВМобильноеПриложение.ЗаПоследнийКвартал;
	ИначеЕсли ПериодВыгрузки = "За последний месяц" Тогда
		ПериодВыгрузкиВМобильноеПриложение = Перечисления.ПериодыВыгрузкиВМобильноеПриложение.ЗаПоследнийМесяц;
	ИначеЕсли ПериодВыгрузки = "За последнюю неделю" Тогда
		ПериодВыгрузкиВМобильноеПриложение = Перечисления.ПериодыВыгрузкиВМобильноеПриложение.ЗаПоследнююНеделю;
	ИначеЕсли ПериодВыгрузки = "За последний день" Тогда
		ПериодВыгрузкиВМобильноеПриложение = Перечисления.ПериодыВыгрузкиВМобильноеПриложение.ЗаПоследнийДень;
	Иначе
		ПериодВыгрузкиВМобильноеПриложение = Перечисления.ПериодыВыгрузкиВМобильноеПриложение.ЗаВсеВремя;
	КонецЕсли;
	
	Если ПериодВыгрузкиВМобильноеПриложениеУстановленный <> ПериодВыгрузкиВМобильноеПриложение Тогда
		МедПредыСервер.УстановитьНастройкуПользователя(ПериодВыгрузкиВМобильноеПриложение, "ПериодВыгрузкиВМобильноеПриложение")
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("Наименование", КодМобильногоКомпьютера);
	МассивЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураОтбора);
	ЕстьАктивноеЗадание = Ложь;
	Для Каждого ФоновоеЗадание Из МассивЗаданий Цикл
		Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			ФоновоеЗадание.Отменить();
		КонецЕсли;
	КонецЦикла;
		
	УзелОбмена = ПланыОбмена.МобильноеПриложение.ЭтотУзел().ПолучитьОбъект();
	Если НЕ ЗначениеЗаполнено(УзелОбмена.Код) Тогда
		
		УзелОбмена.ОбменДанными.Загрузка = Истина;
		УзелОбмена.Код = "001";
		УзелОбмена.Наименование = "Центральный";
		УзелОбмена.Записать();
		
	КонецЕсли;
	
	НужнаИнициализацияУзла = Ложь;
	
	УзелОбмена = ПланыОбмена.МобильноеПриложение.НайтиПоКоду(КодМобильногоКомпьютера); 
	Если УзелОбмена.Пустая() Тогда
		
		ПроверитьВозможностьДобавленияновогоУзла();
		
		НовыйУзел = ПланыОбмена.МобильноеПриложение.СоздатьУзел();
		НовыйУзел.Код = КодМобильногоКомпьютера;
		НовыйУзел.Наименование = ПолучитьНаименованиеНовогоУзла(НаименованиеМобильногоКомпьютера);
		НовыйУзел.ВерсияМобильногоПриложения = ВерсияМобильногоПриложения;
		НовыйУзел.НомерОтправленного = НомерОтправленного;
		НовыйУзел.НомерПринятого = НомерПринятого;
		НовыйУзел.ДатаПоследнейСинхронизации = ТекущаяДатаСеанса();
		НовыйУзел.Пользователь = Пользователь;
		
		ПрофильПользователя = РегистрыСведений.ПрофилиМобильныхПользователей.ПолучитьПрофильПользователя(Пользователь);
		Если ЗначениеЗаполнено(ПрофильПользователя) Тогда
			НовыйУзел.Профиль = ПрофильПользователя; 
		Иначе
			НовыйУзел.Профиль = Перечисления.ПрофилиМобильногоПриложения.МедПредставитель; // Новый узел всегда создается с правами МедПредставитель.
		КонецЕсли;
		
		НовыйУзел.Записать();
		УзелОбмена = НовыйУзел.Ссылка;
		НужнаИнициализацияУзла = Истина;
		
	Иначе
		
		Узел = УзелОбмена.ПолучитьОбъект();
		
		Если Узел.ПометкаУдаления ИЛИ
			Узел.Наименование <> НаименованиеМобильногоКомпьютера ИЛИ
			Узел.ВерсияМобильногоПриложения <> ВерсияМобильногоПриложения Тогда
			Узел.ПометкаУдаления = Ложь;
			Узел.ВерсияМобильногоПриложения = ВерсияМобильногоПриложения;
		КонецЕсли;
						
		Если Узел.НомерОтправленного = 0
			ИЛИ Узел.НомерПринятого = 0
			ИЛИ Узел.НомерОтправленного < НомерПринятого
			ИЛИ Узел.НомерПринятого <> НомерОтправленного Тогда
			Узел.НомерОтправленного = НомерПринятого;
			Узел.НомерПринятого = НомерОтправленного;
			НужнаИнициализацияУзла = Истина;
		КонецЕсли;
		
		Узел.ДатаПоследнейСинхронизации = ТекущаяДатаСеанса();
		Узел.Записать();
		
	КонецЕсли;
	
	ОбменМобильноеПриложениеОбщее.ОбработатьПринятыйПакетЗагрузки(УзелОбмена, ДанныеМобильногоПриложения, Ложь, Истина);
	ОбменМобильноеПриложениеОбщее.ЗапуститьФормированиеОчередиСообщенийОбмена(УзелОбмена, КодМобильногоКомпьютера, НомерПринятого, НужнаИнициализацияУзла, СтруктураОтвета.ИдентификаторЗадания, Истина);
	СтруктураОтвета.НовыйОбмен = НужнаИнициализацияУзла;
	
	Возврат Новый ХранилищеЗначения(СтруктураОтвета, Новый СжатиеДанных(9));
	
КонецФункции

Функция ДобавитьПользователя(ПочтаПользователя, ПарольПользователяСервиса, ПрофильПользователя)
	
	НачатьТранзакцию();
	
	НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
	НовыйПользователь.Наименование = ПочтаПользователя;
	СтруктураАдресаЭП = ПолучитьСтруктуруАдресаЭлектроннойПочты(ПочтаПользователя);
	ОбновитьАдресЭлектроннойПочты(НовыйПользователь, ПочтаПользователя, СтруктураАдресаЭП);
	
	ОписаниеПользователяИБ = Пользователи.НовоеОписаниеПользователяИБ();
	ОписаниеПользователяИБ.Имя = ПочтаПользователя;
	ОписаниеПользователяИБ.АутентификацияСтандартная = Истина;
	ОписаниеПользователяИБ.АутентификацияOpenID = Истина;
	ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора = Ложь;
	ОписаниеПользователяИБ.Вставить("Действие", "Записать");
	ОписаниеПользователяИБ.Вставить("ВходВПрограммуРазрешен", Истина);
	ОписаниеПользователяИБ.Пароль = "" + Новый УникальныйИдентификатор + "qQ";
	
	НовыйПользователь.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
	НовыйПользователь.ДополнительныеСвойства.Вставить("ПарольПользователяСервиса", ПарольПользователяСервиса);
	НовыйПользователь.ДополнительныеСвойства.Вставить("СинхронизироватьССервисом", Истина);
	НовыйПользователь.Записать();
	
	ГруппаДоступа = Справочники.ГруппыДоступа.Администраторы.ПолучитьОбъект();
	ПользовательГруппы = ГруппаДоступа.Пользователи.Добавить();
	ПользовательГруппы.Пользователь = НовыйПользователь.Ссылка;
	ГруппаДоступа.ДополнительныеСвойства.Вставить("ПарольПользователяСервиса", ПарольПользователяСервиса);
	ГруппаДоступа.Записать();
	
	РегистрыСведений.ПрофилиМобильныхПользователей.НазначитьПрофильПользователю(НовыйПользователь.Ссылка, ПрофильПользователя);
	
	ЗафиксироватьТранзакцию();
	
	Возврат НСтр("ru='Пользователю успешно отправлено приглашение на электронный адрес.'");
	
КонецФункции

Функция ОбновитьДанныеПользователя(ПочтаПользователя, ПарольПользователяСервиса, ПрофильПользователя, ВходРазрешен)
	
	НачатьТранзакцию();
	
	Пользователь = Справочники.Пользователи.НайтиПоНаименованию(ПочтаПользователя, Истина);
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат НСтр("ru='Пользователь не найден.'");
	КонецЕсли;
	
	ОписаниеПользователяИБ = Неопределено;
	Пользователи.ПрочитатьПользователяИБ(Пользователь.ИдентификаторПользователяИБ, ОписаниеПользователяИБ);
	
	Если ВходРазрешен Тогда
		ОписаниеПользователяИБ.АутентификацияСтандартная = Истина;
		ОписаниеПользователяИБ.АутентификацияOpenID = Истина;
	Иначе
		ОписаниеПользователяИБ.АутентификацияСтандартная = Ложь;
		ОписаниеПользователяИБ.АутентификацияOpenID = Ложь;
	КонецЕсли;
	
	ОписаниеПользователяИБ.Вставить("Действие", "Записать");
	ПользовательОбъект = Пользователь.ПолучитьОбъект();
	ПользовательОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
	ПользовательОбъект.ДополнительныеСвойства.Вставить("ПарольПользователяСервиса", ПарольПользователяСервиса);
	ПользовательОбъект.ДополнительныеСвойства.Вставить("СинхронизироватьССервисом", Истина);
	ПользовательОбъект.Записать();
	
	РегистрыСведений.ПрофилиМобильныхПользователей.НазначитьПрофильПользователю(Пользователь, ПрофильПользователя);
	
	ЗафиксироватьТранзакцию();
	
	Возврат НСтр("ru='Параметры пользователя успешно изменены.'");
	
КонецФункции

Функция ПолучитьСписокПользователей()
	
	Запрос = Новый Запрос();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.ИдентификаторПользователяИБ,
	|	Пользователи.Наименование,
	|	Пользователи.Недействителен,
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.Служебный
	|	И Пользователи.ИдентификаторПользователяИБ <> &ПустойИД";
	
	Запрос.УстановитьПараметр("ПустойИД", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивПользователей = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		Профиль = РегистрыСведений.ПрофилиМобильныхПользователей.ПолучитьПрофильПользователя(Выборка.Ссылка);
		ВходВПрограммуРазрешен = Пользователи.ВходВПрограммуРазрешен(Выборка.ИдентификаторПользователяИБ);
		МассивПользователей.Добавить(
			Новый Структура("Наименование, ИдентификаторПользователяИБ, Недействителен, ВходВПрограммуРазрешен, Профиль",
			Выборка.Наименование,
			Выборка.ИдентификаторПользователяИБ,
			Выборка.Недействителен,
			ВходВПрограммуРазрешен,
			Перечисления.ПрофилиМобильногоПриложения.ПолучитьСтроковоеПредставление(Профиль))
		);
	КонецЦикла;
	
	МассивXDTO = СериализаторXDTO.ЗаписатьXDTO(МассивПользователей);
	Возврат МассивXDTO;
	
КонецФункции

Функция ОтправитьПакетОбменаВСервисСИдентификатором(ДанныеМобильногоПриложения, КодМобильногоКомпьютера, НаименованиеМобильногоКомпьютера, НомерОтправленного, НомерПринятого, ПериодВыгрузки, ВерсияМобильногоПриложения, ИДПодписчика)
	
	СтруктураОтвета = Новый Структура("ИдентификаторЗадания, НовыйОбмен", Неопределено, Ложь);
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	ПроверитьДоступУстройства(КодМобильногоКомпьютера);
	ПроверитьДоступВерсии(ВерсияМобильногоПриложения);

	УстановитьПривилегированныйРежим(Истина);
	
	ПериодВыгрузкиВМобильноеПриложение = Перечисления.ПериодыВыгрузкиВМобильноеПриложение.ЗаВсеВремя;
	ПериодВыгрузкиВМобильноеПриложениеУстановленный = Пользователи.ТекущийПользователь();

	Если ПериодВыгрузкиВМобильноеПриложениеУстановленный <> ПериодВыгрузкиВМобильноеПриложение Тогда
		МедПредыСервер.УстановитьНастройкуПользователя(ПериодВыгрузкиВМобильноеПриложение, "ПериодВыгрузкиВМобильноеПриложение")
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("Наименование", КодМобильногоКомпьютера);
	МассивЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураОтбора);
	ЕстьАктивноеЗадание = Ложь;
	Для каждого ФоновоеЗадание Из МассивЗаданий Цикл
		Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			ФоновоеЗадание.Отменить();
		КонецЕсли;
	КонецЦикла;
	
	УзелОбмена = ПланыОбмена.МобильноеПриложение.ЭтотУзел().ПолучитьОбъект();
	Если НЕ ЗначениеЗаполнено(УзелОбмена.Код) Тогда
		УзелОбмена.ОбменДанными.Загрузка = Истина;
		УзелОбмена.Код = "001";
		УзелОбмена.Наименование = "Центральный";
		УзелОбмена.Записать();
	КонецЕсли;
	
	НужнаИнициализацияУзла = Ложь;
	
	УзелОбмена = ПланыОбмена.МобильноеПриложение.НайтиПоКоду(КодМобильногоКомпьютера); 
	Если УзелОбмена.Пустая() Тогда
		
		ПроверитьВозможностьДобавленияновогоУзла();
		
		НовыйУзел = ПланыОбмена.МобильноеПриложение.СоздатьУзел();
		НовыйУзел.Код = КодМобильногоКомпьютера;
		НовыйУзел.Наименование = ПолучитьНаименованиеНовогоУзла(НаименованиеМобильногоКомпьютера);
		НовыйУзел.ВерсияМобильногоПриложения = ВерсияМобильногоПриложения;
		НовыйУзел.НомерОтправленного = НомерОтправленного;
		НовыйУзел.НомерПринятого = НомерПринятого;
		НовыйУзел.ДатаПоследнейСинхронизации = ТекущаяДатаСеанса();
		
		НовыйУзел.Пользователь = Пользователь;
		
		ПрофильПользователя = РегистрыСведений.ПрофилиМобильныхПользователей.ПолучитьПрофильПользователя(Пользователь);
		Если ЗначениеЗаполнено(ПрофильПользователя) Тогда
			НовыйУзел.Профиль = ПрофильПользователя; 
		Иначе
			НовыйУзел.Профиль = Перечисления.ПрофилиМобильногоПриложения.МедПредставитель; // Новый узел всегда создается с правами МедПредставитель.
		КонецЕсли;
		
		Если ИДПодписчика <> Неопределено Тогда
			НовыйУзел.ИДПодписчика = Новый ХранилищеЗначения(ИДПодписчика);
		КонецЕсли;
		
		НовыйУзел.Записать();
		УзелОбмена = НовыйУзел.Ссылка;
		НужнаИнициализацияУзла = Истина;
		
	Иначе
		
		Узел = УзелОбмена.ПолучитьОбъект();
		
		Если УзелОбмена.ПометкаУдаления ИЛИ
			УзелОбмена.Наименование <> НаименованиеМобильногоКомпьютера ИЛИ
			УзелОбмена.ВерсияМобильногоПриложения <> ВерсияМобильногоПриложения ИЛИ
			(ИДПодписчика <> Неопределено И УзелОбмена.ИДПодписчика.Получить() = Неопределено) Тогда
			Узел.ПометкаУдаления = Ложь;
			Узел.ВерсияМобильногоПриложения = ВерсияМобильногоПриложения;
			Если ИДПодписчика <> Неопределено Тогда
				Узел.ИДПодписчика = Новый ХранилищеЗначения(ИДПодписчика);
			КонецЕсли;
		КонецЕсли;
				
		Если УзелОбмена.НомерОтправленного = 0
			ИЛИ УзелОбмена.НомерПринятого = 0
			ИЛИ УзелОбмена.НомерОтправленного < НомерПринятого
			ИЛИ УзелОбмена.НомерПринятого <> НомерОтправленного Тогда
			Узел.НомерОтправленного = НомерПринятого;
			Узел.НомерПринятого = НомерОтправленного;
			НужнаИнициализацияУзла = Истина;
		КонецЕсли;
				
		Узел.ДатаПоследнейСинхронизации = ТекущаяДатаСеанса();
		Если Узел.НужнаИнициализацияУзла Тогда
			СтруктураОтвета.Вставить("НужнаИнициализацияУзла", Истина);
			Узел.НужнаИнициализацияУзла = Ложь;
		КонецЕсли;
		Узел.Записать();
		
	КонецЕсли;
	
	ОбменМобильноеПриложениеОбщее.ОбработатьПринятыйПакетЗагрузки(УзелОбмена, ДанныеМобильногоПриложения, Ложь);
	ОбменМобильноеПриложениеОбщее.ЗапуститьФормированиеОчередиСообщенийОбмена(УзелОбмена, КодМобильногоКомпьютера, НомерПринятого, НужнаИнициализацияУзла, СтруктураОтвета.ИдентификаторЗадания);
	СтруктураОтвета.НовыйОбмен = НужнаИнициализацияУзла;
	
	Возврат Новый ХранилищеЗначения(СтруктураОтвета, Новый СжатиеДанных(9));
	
КонецФункции

Функция ПолучитьФотоТовара(Номенклатура)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(Номенклатура);
	Ссылка = Справочники.Номенклатура.ПолучитьСсылку(Идентификатор);
	
	Возврат ОбменМобильноеПриложениеОбщее.ПолучитьКартинку(Ссылка);
	
КонецФункции

Функция ЭтоМобильныйТарифныйПлан()
	
	УстановитьПривилегированныйРежим(Истина);
	ЭтоМобильноеПриложение = Константы.ЭтоМобильноеПриложение.Получить();
	Возврат ЭтоМобильноеПриложение;
	
КонецФункции

Функция ПолучитьКоличествоУстройств()
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(МобильноеПриложение.Ссылка) КАК КоличествоУзлов
	|ИЗ
	|	ПланОбмена.МобильноеПриложение КАК МобильноеПриложение
	|ГДЕ
	|	НЕ МобильноеПриложение.ПометкаУдаления
	|	И НЕ МобильноеПриложение.ДоступЗапрещен
	|	И НЕ МобильноеПриложение.ЭтотУзел";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Строка(Выборка.КоличествоУзлов);
	Иначе
		Возврат "0";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПраваПользователя(Пользователь = Неопределено)
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	Если НЕ РольДоступна(Метаданные.Роли.ПолныеПрава)
	   И НЕ(РольДоступна(Метаданные.Роли.МедПредставитель) // Профиль Базовые права.
		  И РольДоступна(Метаданные.Роли.Супервайзер)) Тогда // Профиль Деньги.
		
		ВызватьИсключение(
			НСтр("ru='У пользователя ""'")
		  + Пользователь
		  + НСтр("ru='"" нет прав на синхронизацию данных с мобильным приложением DENIS Pharm Group мед.представители. Необходимо включить профили прав доступа Мед.прдеставитель или Супервайзер.'")
		);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДоступУстройства(КодМобильногоКомпьютера)
	
	УзелОбмена = ПланыОбмена.МобильноеПриложение.НайтиПоКоду(КодМобильногоКомпьютера); 
	Если УзелОбмена.ДоступЗапрещен Тогда
		ВызватьИсключение(
			НСтр("ru='Устройству запрещена синхронизация с центральной базой.'")
		);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДоступВерсии(ВерсияМобильногоПриложения)
	
	ТребуемаяВерсияМобильногоКлиента = Константы.ТребуемаяВерсияМобильногоКлиента.Получить();
	Если ВерсияМобильногоПриложения < ТребуемаяВерсияМобильногоКлиента Тогда 
		ВызватьИсключение(
			СтрШаблон(НСтр("ru='Для синхронизации с центральной базой обновите приложение до версии не ниже |%1~'"),ТребуемаяВерсияМобильногоКлиента)
		);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНаименованиеНовогоУзла(ПредлагаемоеНаименование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МобильноеПриложение.Наименование КАК Наименование
	|ИЗ
	|	ПланОбмена.МобильноеПриложение КАК МобильноеПриложение
	|ГДЕ
	|	МобильноеПриложение.Наименование ПОДОБНО &ПредлагаемоеНаименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование УБЫВ";
	Запрос.УстановитьПараметр("ПредлагаемоеНаименование", ПредлагаемоеНаименование + " #%");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МобильноеПриложение.Наименование КАК Наименование
		|ИЗ
		|	ПланОбмена.МобильноеПриложение КАК МобильноеПриложение
		|ГДЕ
		|	МобильноеПриложение.Наименование = &ПредлагаемоеНаименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование УБЫВ";
		Запрос.УстановитьПараметр("ПредлагаемоеНаименование", ПредлагаемоеНаименование);
		РезультатЗапроса = Запрос.Выполнить();
	КонецЕсли;
	
	ВыборкаРезультата = РезультатЗапроса.Выбрать();
	
	Если ВыборкаРезультата.Следующий() Тогда
		НаименованиеУзла = СтрЗаменить(НРег(ВыборкаРезультата.Наименование), НРег(ПредлагаемоеНаименование), "");
		Номер = СтрЗаменить(НаименованиеУзла, " #", "");
		Если ПустаяСтрока(Номер) Тогда
			СледующийНомер = 1;
		Иначе
			Попытка
				СледующийНомер = Число(СокрЛП(Номер)) + 1;
			Исключение
				СледующийНомер = 1;
			КонецПопытки;
		КонецЕсли;
		Возврат ПредлагаемоеНаименование + " #" + Строка(СледующийНомер); 
	Иначе	
		Возврат ПредлагаемоеНаименование; 
	КонецЕсли;
	
КонецФункции

Процедура ОбновитьАдресЭлектроннойПочты(Знач ПользовательОбъект, Знач Адрес, Знач СтруктураАдресаЭП)
	
	ВидКИ = Справочники.ВидыКонтактнойИнформации.EmailПользователя;
	
	СтрокаТабличнойЧасти = ПользовательОбъект.КонтактнаяИнформация.Найти(ВидКИ, "Вид");
	Если СтруктураАдресаЭП = Неопределено Тогда
		Если СтрокаТабличнойЧасти <> Неопределено Тогда
			ПользовательОбъект.КонтактнаяИнформация.Удалить(СтрокаТабличнойЧасти);
		КонецЕсли;
	Иначе
		Если СтрокаТабличнойЧасти = Неопределено Тогда
			СтрокаТабличнойЧасти = ПользовательОбъект.КонтактнаяИнформация.Добавить();
			СтрокаТабличнойЧасти.Вид = ВидКИ;
		КонецЕсли;
		СтрокаТабличнойЧасти.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		СтрокаТабличнойЧасти.Представление = Адрес;
		
		Если СтруктураАдресаЭП.Количество() > 0 Тогда
			СтрокаТабличнойЧасти.АдресЭП = СтруктураАдресаЭП[0].Адрес;
			
			Поз = СтрНайти(СтрокаТабличнойЧасти.АдресЭП, "@");
			Если Поз <> 0 Тогда
				СтрокаТабличнойЧасти.ДоменноеИмяСервера = Сред(СтрокаТабличнойЧасти.АдресЭП, Поз + 1);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруАдресаЭлектроннойПочты(Знач АдресЭлектроннойПочты)
	
	Если ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
		
		Попытка
			СтруктураАдресаЭП = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(АдресЭлектроннойПочты);
		Исключение
			ШаблонСообщения = НСтр("ru = 'Указан некорректный адрес электронной почты: %1
				|Ошибка: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, АдресЭлектроннойПочты, ИнформацияОбОшибке().Описание);
			ВызватьИсключение(ТекстСообщения);
		КонецПопытки;
		
		Возврат СтруктураАдресаЭП;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьВозможностьДобавленияновогоУзла()
	
	МобильноеПриложениеВызовСервера.ПередНачаломРаботыКлиента();
	
КонецПроцедуры

#КонецОбласти

#Область ФункцииДляПоддержкиСовместимости

Функция НачатьОбмен(КодМобильногоКомпьютера, НаименованиеМобильногоКомпьютера, НомерОтправленного, НомерПринятого, ПериодВыгрузки)
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	
	ПроверитьПраваПользователя(Пользователь);
	ПроверитьДоступУстройства(КодМобильногоКомпьютера);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПериодВыгрузкиВМобильноеПриложениеУстановленный = МедПредыПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		Пользователь,
		"ПериодВыгрузкиВМобильноеПриложение"
	);

	Если ПериодВыгрузки = "За последний квартал" Тогда
		ПериодВыгрузкиВМобильноеПриложение = Перечисления.ПериодыВыгрузкиВМобильноеПриложение.ЗаПоследнийКвартал;
	ИначеЕсли ПериодВыгрузки = "За последний месяц" Тогда
		ПериодВыгрузкиВМобильноеПриложение = Перечисления.ПериодыВыгрузкиВМобильноеПриложение.ЗаПоследнийМесяц;
	ИначеЕсли ПериодВыгрузки = "За последнюю неделю" Тогда
		ПериодВыгрузкиВМобильноеПриложение = Перечисления.ПериодыВыгрузкиВМобильноеПриложение.ЗаПоследнююНеделю;
	ИначеЕсли ПериодВыгрузки = "За последний день" Тогда
		ПериодВыгрузкиВМобильноеПриложение = Перечисления.ПериодыВыгрузкиВМобильноеПриложение.ЗаПоследнийДень;
	Иначе
		ПериодВыгрузкиВМобильноеПриложение = Перечисления.ПериодыВыгрузкиВМобильноеПриложение.ЗаВсеВремя;
	КонецЕсли;
	
	Если ПериодВыгрузкиВМобильноеПриложениеУстановленный <> ПериодВыгрузкиВМобильноеПриложение Тогда
		МедПредыСервер.УстановитьНастройкуПользователя(ПериодВыгрузкиВМобильноеПриложение, "ПериодВыгрузкиВМобильноеПриложение")
	КонецЕсли;
	
	УзелОбмена = ПланыОбмена.МобильноеПриложение.ЭтотУзел().ПолучитьОбъект();
	Если НЕ ЗначениеЗаполнено(УзелОбмена.Код) Тогда
		
		УзелОбмена.ОбменДанными.Загрузка = Истина;
		УзелОбмена.Код = "001";
		УзелОбмена.Наименование = "Центральный";
		УзелОбмена.Записать();
		
	КонецЕсли;
	
	УзелОбмена = ПланыОбмена.МобильноеПриложение.НайтиПоКоду(КодМобильногоКомпьютера); 
	Если УзелОбмена.Пустая() Тогда
		
		ПроверитьВозможностьДобавленияновогоУзла();
		
		НовыйУзел = ПланыОбмена.МобильноеПриложение.СоздатьУзел();
		НовыйУзел.Код = КодМобильногоКомпьютера;
		НовыйУзел.Наименование = НаименованиеМобильногоКомпьютера;
		НовыйУзел.НомерОтправленного = НомерОтправленного;
		НовыйУзел.НомерПринятого = НомерПринятого;
		НовыйУзел.Пользователь = Пользователь;
		
		ПрофильПользователя = РегистрыСведений.ПрофилиМобильныхПользователей.ПолучитьПрофильПользователя(Пользователь);
		Если ЗначениеЗаполнено(ПрофильПользователя) Тогда
			НовыйУзел.Профиль = ПрофильПользователя; 
		Иначе
			НовыйУзел.Профиль = Перечисления.ПрофилиМобильногоПриложения.МедПредставитель; // Новый узел всегда создается с правами МедПредставитель.
		КонецЕсли;
		
		НовыйУзел.Записать();
		ОбменМобильноеПриложениеОбщее.ЗарегистрироватьИзмененияДанных(НовыйУзел.Ссылка);
		УзелОбмена = НовыйУзел.Ссылка;
		
	Иначе
		
		Если УзелОбмена.ПометкаУдаления ИЛИ
			УзелОбмена.Наименование <> НаименованиеМобильногоКомпьютера Тогда
			
			Узел = УзелОбмена.ПолучитьОбъект();
			Узел.ПометкаУдаления = Ложь;
			Узел.Наименование = НаименованиеМобильногоКомпьютера;
			Узел.Записать();
			
		КонецЕсли;
				
		Если УзелОбмена.НомерОтправленного <> НомерОтправленного ИЛИ
			 УзелОбмена.НомерПринятого <> НомерПринятого Тогда
			
			Узел = УзелОбмена.ПолучитьОбъект();
			Узел.НомерОтправленного = НомерОтправленного;
			Узел.НомерПринятого = НомерПринятого;
			Узел.Записать();
			
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена);
			ОбменМобильноеПриложениеОбщее.ЗарегистрироватьИзмененияДанных(УзелОбмена);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ПринятьПакетОбмена(ДанныеМобильногоПриложения, КодМобильногоКомпьютера, НаименованиеМобильногоКомпьютера, НомерОтправленного, НомерПринятого, ПериодВыгрузки)
	
	СтруктураОтвета = Новый Структура("ИдентификаторЗадания, НовыйОбмен", Неопределено, Ложь);
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	
	ПроверитьПраваПользователя(Пользователь);
	ПроверитьДоступУстройства(КодМобильногоКомпьютера);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПериодВыгрузкиВМобильноеПриложениеУстановленный = МедПредыПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		Пользователь,
		"ПериодВыгрузкиВМобильноеПриложение"
	);

	Если ПериодВыгрузки = "За последний квартал" Тогда
		ПериодВыгрузкиВМобильноеПриложение = Перечисления.ПериодыВыгрузкиВМобильноеПриложение.ЗаПоследнийКвартал;
	ИначеЕсли ПериодВыгрузки = "За последний месяц" Тогда
		ПериодВыгрузкиВМобильноеПриложение = Перечисления.ПериодыВыгрузкиВМобильноеПриложение.ЗаПоследнийМесяц;
	ИначеЕсли ПериодВыгрузки = "За последнюю неделю" Тогда
		ПериодВыгрузкиВМобильноеПриложение = Перечисления.ПериодыВыгрузкиВМобильноеПриложение.ЗаПоследнююНеделю;
	ИначеЕсли ПериодВыгрузки = "За последний день" Тогда
		ПериодВыгрузкиВМобильноеПриложение = Перечисления.ПериодыВыгрузкиВМобильноеПриложение.ЗаПоследнийДень;
	Иначе
		ПериодВыгрузкиВМобильноеПриложение = Перечисления.ПериодыВыгрузкиВМобильноеПриложение.ЗаВсеВремя;
	КонецЕсли;
	
	Если ПериодВыгрузкиВМобильноеПриложениеУстановленный <> ПериодВыгрузкиВМобильноеПриложение Тогда
		МедПредыСервер.УстановитьНастройкуПользователя(ПериодВыгрузкиВМобильноеПриложение, "ПериодВыгрузкиВМобильноеПриложение")
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("Наименование", КодМобильногоКомпьютера);
	МассивЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураОтбора);
	ЕстьАктивноеЗадание = Ложь;
	Для Каждого ФоновоеЗадание Из МассивЗаданий Цикл
		Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			ФоновоеЗадание.Отменить();
		КонецЕсли;
	КонецЦикла;
	
	УзелОбмена = ПланыОбмена.МобильноеПриложение.ЭтотУзел().ПолучитьОбъект();
	Если НЕ ЗначениеЗаполнено(УзелОбмена.Код) Тогда
		
		УзелОбмена.ОбменДанными.Загрузка = Истина;
		УзелОбмена.Код = "001";
		УзелОбмена.Наименование = "Центральный";
		УзелОбмена.Записать();
		
	КонецЕсли;
	
	НужнаИнициализацияУзла = Ложь;
	
	УзелОбмена = ПланыОбмена.МобильноеПриложение.НайтиПоКоду(КодМобильногоКомпьютера); 
	Если УзелОбмена.Пустая() Тогда
		
		ПроверитьВозможностьДобавленияновогоУзла();
		
		НовыйУзел = ПланыОбмена.МобильноеПриложение.СоздатьУзел();
		НовыйУзел.Код = КодМобильногоКомпьютера;
		НовыйУзел.Наименование = НаименованиеМобильногоКомпьютера;
		НовыйУзел.НомерОтправленного = НомерОтправленного;
		НовыйУзел.НомерПринятого = НомерПринятого;
		НовыйУзел.Записать();
		УзелОбмена = НовыйУзел.Ссылка;
		НужнаИнициализацияУзла = Истина;
		
	Иначе
		
		Если УзелОбмена.ПометкаУдаления ИЛИ
			УзелОбмена.Наименование <> НаименованиеМобильногоКомпьютера Тогда
			
			Узел = УзелОбмена.ПолучитьОбъект();
			Узел.ПометкаУдаления = Ложь;
			Узел.Наименование = НаименованиеМобильногоКомпьютера;
			Узел.Записать();
			
		КонецЕсли;
				
		Если УзелОбмена.НомерОтправленного = 0
			ИЛИ УзелОбмена.НомерПринятого = 0
			ИЛИ УзелОбмена.НомерОтправленного < НомерПринятого
			ИЛИ УзелОбмена.НомерПринятого <> НомерОтправленного Тогда
			
			Узел = УзелОбмена.ПолучитьОбъект();
			Узел.НомерОтправленного = НомерПринятого;
			Узел.НомерПринятого = НомерОтправленного;
			Узел.Записать();
			
			НужнаИнициализацияУзла = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбменМобильноеПриложениеОбщее.ОбработатьПринятыйПакетЗагрузки(УзелОбмена, ДанныеМобильногоПриложения);
	
	ОбменМобильноеПриложениеОбщее.ЗапуститьФормированиеОчередиСообщенийОбмена(УзелОбмена, КодМобильногоКомпьютера, НомерПринятого, НужнаИнициализацияУзла, СтруктураОтвета.ИдентификаторЗадания);
	СтруктураОтвета.НовыйОбмен = НужнаИнициализацияУзла;
	
	Возврат Новый ХранилищеЗначения(СтруктураОтвета, Новый СжатиеДанных(9));
	
КонецФункции

#КонецОбласти
